In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [10]:
import pandas_datareader as pdr

In [13]:
all_data = {}
for ticker in ['IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = pdr.get_data_yahoo(ticker)
    
all_data

RemoteDataError: Unable to read URL: http://ichart.finance.yahoo.com/table.csv?s=IBM&a=0&b=1&c=2010&d=5&e=10&f=2017&g=d&ignore=.csv

In [14]:
obj = Series(list('cadaabbcc'))

In [15]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [16]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [17]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [18]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [19]:
df = DataFrame({'Qu1' : [1, 3, 4, 3, 4],
                'Qu2' : [2, 3, 1, 2, 3],
                'Qu3' : [1, 5, 2, 4, 4]})
df

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [20]:
result = df.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [21]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [22]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [23]:
data = Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [24]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data = DataFrame([[1., 6.5, 3.],
                  [1, np.nan, np.nan],
                  [np.nan, np.nan, np.nan],
                  [np.nan, 6.5, 3.]])
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [28]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [29]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [30]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [33]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [35]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.926146 -1.271959  0.777246
1  0.669697  0.726587  1.277278
2 -0.656911  0.292782  0.154870
3 -0.987786 -1.095611  1.803881
4 -1.218587 -0.315563  0.012396
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [37]:
df.ix[:4, 1] = np.nan
df.ix[:2, 2] = np.nan
df

          0         1         2
0 -0.926146       NaN       NaN
1  0.669697       NaN       NaN
2 -0.656911       NaN       NaN
3 -0.987786       NaN  1.803881
4 -1.218587       NaN  0.012396
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [41]:
df.dropna(thresh = 3)

          0         1         2
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [43]:
df.fillna(0)

          0         1         2
0 -0.926146  0.000000  0.000000
1  0.669697  0.000000  0.000000
2 -0.656911  0.000000  0.000000
3 -0.987786  0.000000  1.803881
4 -1.218587  0.000000  0.012396
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [44]:
df.fillna({1 : 0.5, 3 : -1})

          0         1         2
0 -0.926146  0.500000       NaN
1  0.669697  0.500000       NaN
2 -0.656911  0.500000       NaN
3 -0.987786  0.500000  1.803881
4 -1.218587  0.500000  0.012396
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [46]:
df.fillna(0, inplace = True)
df

          0         1         2
0 -0.926146  0.000000  0.000000
1  0.669697  0.000000  0.000000
2 -0.656911  0.000000  0.000000
3 -0.987786  0.000000  1.803881
4 -1.218587  0.000000  0.012396
5  0.511702 -0.416387 -0.238253
6  1.055907  0.010851 -0.737679

In [47]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = np.nan
df.ix[4:, 2] = np.nan
df

          0         1         2
0 -1.909524 -1.652112 -0.076914
1 -1.036873 -0.586205 -1.598724
2  0.149483       NaN -1.038821
3 -1.458301       NaN -0.416097
4 -0.117156       NaN       NaN
5 -0.734223       NaN       NaN

In [48]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.909524 -1.652112 -0.076914
1 -1.036873 -0.586205 -1.598724
2  0.149483 -0.586205 -1.038821
3 -1.458301 -0.586205 -0.416097
4 -0.117156 -0.586205 -0.416097
5 -0.734223 -0.586205 -0.416097

In [50]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -1.909524 -1.652112 -0.076914
1 -1.036873 -0.586205 -1.598724
2  0.149483 -0.586205 -1.038821
3 -1.458301 -0.586205 -0.416097
4 -0.117156       NaN -0.416097
5 -0.734223       NaN -0.416097

In [51]:
df.fillna(df.mean())

          0         1         2
0 -1.909524 -1.652112 -0.076914
1 -1.036873 -0.586205 -1.598724
2  0.149483 -1.119158 -1.038821
3 -1.458301 -1.119158 -0.416097
4 -0.117156 -1.119158 -0.782639
5 -0.734223 -1.119158 -0.782639

In [52]:
data = Series(np.random.randn(10),
              index = [list('aaabbbccdd'), 
                       [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    1.372091
   2   -0.251959
   3   -2.214907
b  1   -0.351220
   2   -0.585478
   3    2.007993
c  1   -0.218729
   2   -0.629041
d  2    1.648315
   3    1.736258
dtype: float64

In [53]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [55]:
data.ix['b']

1   -0.351220
2   -0.585478
3    2.007993
dtype: float64

In [57]:
data['b':'c']

b  1   -0.351220
   2   -0.585478
   3    2.007993
c  1   -0.218729
   2   -0.629041
dtype: float64

In [58]:
data[['b', 'd']]

b  1   -0.351220
   2   -0.585478
   3    2.007993
d  2    1.648315
   3    1.736258
dtype: float64

In [59]:
data[:, 2]

a   -0.251959
b   -0.585478
c   -0.629041
d    1.648315
dtype: float64

In [60]:
data.unstack()

          1         2         3
a  1.372091 -0.251959 -2.214907
b -0.351220 -0.585478  2.007993
c -0.218729 -0.629041       NaN
d       NaN  1.648315  1.736258

In [61]:
data.unstack().stack()

a  1    1.372091
   2   -0.251959
   3   -2.214907
b  1   -0.351220
   2   -0.585478
   3    2.007993
c  1   -0.218729
   2   -0.629041
d  2    1.648315
   3    1.736258
dtype: float64

In [62]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index = [list('aabb'), [1, 2, 1, 2]],
                  columns = [['Ohio', 'Ohio', 'Colorado'],
                             ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [63]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [65]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [66]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [67]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [68]:
frame.swaplevel('key1', 'key2').sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [69]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [70]:
frame.sum(level='color', axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [75]:
frame = DataFrame({'a' : np.arange(7), 
                   'b' : np.arange(7, 0, -1),
                   'c' : ['one'] * 3 + ['two'] * 4,
                   'd' : [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [76]:
frame.set_index(['c', 'd'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [77]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [78]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3